In [1]:
import pandas as pd

In [2]:
data_dict = {
    'name':['Alice','Bob','Diana','Charlie'],
    'age':[25,40,35,28],
    'city':['NewYork','London','Tokyo','Paris'],
    'salary':[50000,70000,60000,55000]}

In [3]:
df_data_dict = pd.DataFrame(data_dict)

In [4]:
df_data_dict

      name  age     city  salary
0    Alice   25  NewYork   50000
1      Bob   40   London   70000
2    Diana   35    Tokyo   60000
3  Charlie   28    Paris   55000

In [7]:
df_data_dict.shape

(4, 4)

In [10]:
df_data_dict.columns

Index(['name', 'age', 'city', 'salary'], dtype='str')

In [17]:
series_dict = {
    'math':pd.Series([85,90,78],index =['alice','bob','charlie']),
    'sciecne':pd.Series([88,92,84],index = ['alice','bob','charlie']),
    'social':pd.Series([90,86,88],index = ['alice','bob','charlie'])}

In [18]:
df_series_dict = pd.DataFrame(series_dict)

In [20]:
df_series_dict

         math  sciecne  social
alice      85       88      90
bob        90       92      86
charlie    78       84      88

In [22]:
data_list = [
    ['alice',27,'New York',70000],
    ['bob',28,'London',60000],
    ['charlie',29,'Tokyo',80000]]

In [26]:
df_data_list = pd.DataFrame(data_list,columns=['name','age','city','salary'])

In [27]:
df_data_list

      name  age      city  salary
0    alice   27  New York   70000
1      bob   28    London   60000
2  charlie   29     Tokyo   80000

In [28]:
list_dicts = [
    {'name':'Alcie','Age':29,'city':'New York'},
    {'name':'Bob','Age':32,'city':'Paris'},
    {'name':'Charlie','Age':28,'city':'Tokyo'}]

In [29]:
df_list_dicts = pd.DataFrame(list_dicts)

In [30]:
df_list_dicts

      name  Age      city
0    Alcie   29  New York
1      Bob   32     Paris
2  Charlie   28     Tokyo

In [32]:
import numpy as np
arr = np.array([
    [1,'Alice',25],
    [2,'Bob',28],
    [3,'Charlie',29]])

In [33]:
df_arr = pd.DataFrame(arr,columns=['id','name','age'])

In [34]:
df_arr

  id     name age
0  1    Alice  25
1  2      Bob  28
2  3  Charlie  29

In [37]:
df_arr.dtypes

id      str
name    str
age     str
dtype: object

In [41]:
np_mixed = {
    'A':np.random.rand(5),
    'B':np.arange(5),
    'C':list('abcde')}

In [42]:
df_np_mixed = pd.DataFrame(np_mixed)

In [43]:
df_np_mixed

          A  B  C
0  0.766690  0  a
1  0.813502  1  b
2  0.684087  2  c
3  0.393548  3  d
4  0.885035  4  e